
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"><!-- InstanceBegin template="/Templates/FireBase2011.dwt.php" codeOutsideHTMLIsLocked="false" -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link rel="icon" href="http://www.firebase.com.br/fb/favicon.ico" type="image/x-icon"/>
<meta name="DISTRIBUTION" content="GLOBAL" />
<meta name="AUTHOR" content="FireBase" />
<meta name="COPYRIGHT" content="Copyright (c) by Carlos H. Cantu" />
<meta name="Keywords" content="Firebird, firebird, InterBase, FireBase, firebase, Firebase, News, news, New, new, Technology, technology, Headlines, headlines, Open, open, Open Source, OpenSource, Opensource, opensource, open source, Free Software, FreeSoftware, Freesoftware, free software, MySQL, mysql, SQL, sql, Database, DataBase, Programming, programming, Extreme, extreme, Oracle, oracle, db2, DB2, odbc, ODBC, client, server, cliente, servidor, cantu, ibobjects, ibo, chcfilter, warmboot, firebirdsql, sgbd" />
<meta name="Description" content="Maior portal brasileiro sobre banco de dados Firebird e InterBase" />
<meta name="ROBOTS" content="INDEX,NOARCHIVE" />
<meta name="RATING" content="GENERAL" />
<!-- InstanceBeginEditable name="doctitle" -->
<!-- InstanceEndEditable -->
<link href="styles.css" rel="stylesheet" type="text/css" />
<script src="http://www.google-analytics.com/urchin.js" type="text/javascript">
</script>
<script type="text/javascript">
_uacct = "UA-268892-2";
urchinTracker();
</script>
<!-- InstanceBeginEditable name="head" -->
<!-- InstanceEndEditable -->
</head>
<body>
<div id="RotBanner">
  <a href="http://www.firebase.com.br/fb/redir.php?b=66" target="_blank"><img border="0" src="http://feeds.feedburner.com/CantuBlog.1.gif" width="468" height="60"></img></a></td></div>
<div id="Stats">
<b>Usuários:</b> 67112<br><b>Artigos:</b> 188<br><b>Dicas:</b> 128<br><b>Downloads:</b> 284<br>09.03.12</div> 
<table width="1024" border="0" cellspacing="0" cellpadding="0">
  <tr>
    <td><img src="menu/top.png" width="1025" height="152" border="0" usemap="#MapMenu" /></td> 
  </tr>
  <tr style="background-image:url(menu/backgd.png);background-repeat:no-repeat"> 
    <td><br />
    <table width="985px" border="0" cellspacing="0" cellpadding="0" align="center"><tr><td><!-- InstanceBeginEditable name="Corpo" -->
            <title>Diagnosticando e Reparando Banco de Dados Corrompidos</title>            <div align="center"> 
              <script type="text/javascript"><!--
			  google_ad_client = "pub-8009790593141284";
			  google_ad_width = 728;
			  google_ad_height = 15;
			  google_ad_format = "728x15_0ads_al_s";
			  //2006-12-31: BlocosLinksArtigosFAQ
			  google_ad_channel = "9067888167";
			  google_color_border = "000000";
			  google_color_bg = "F0F0F0";
			  google_color_link = "0000FF";
			  google_color_text = "000000";
			  google_color_url = "008000";
			  //--></script> 
              <script type="text/javascript" src="http://pagead2.googlesyndication.com/pagead/show_ads.js"></script> 
            </div>
            <!-- google_ad_section_start -->
            <table width="98%" border="0" align="center" cellpadding="0" cellspacing="0">
              <tr>
                <td colspan="2" class="TextoPadrao">
	 <h2 align="center">Diagnosticando e Reparando Banco de Dados Corrompidos</h2><p>Data da última atualização: 12/09/2002</p><P><font face="Arial, Helvetica, sans-serif">Atualizada e revisada em 29 Setembro   2000 por Paul Beach<br>  Tradu&ccedil;&atilde;o/adapta&ccedil;&atilde;o : Carlos H. Cantu (<a href="http://www.firebase.com.br">www.firebase.com.br</a>)</font> </P><P>&nbsp;</P><p><b>Caso seu banco de dados esteja muito corrompido, e os procedimentos abaixo não forem suficientes para recuperá-lo, verifique nosso <a href="http://www.firebase.com.br/fb/parceria_ibaid.php">serviço de recuperação de base de dados</a>.</b></p><P><font face="Arial, Helvetica, sans-serif">Um n&uacute;mero grande de tipos   de corrup&ccedil;&otilde;es podem ser reparadas atrav&eacute;s dos utilit&aacute;rios   gfix e gbak. No entanto, &eacute; poss&iacute;vel que em alguns casos raros   o arquivo de banco de dados esteja corrompido de tal maneira que seja imposs&iacute;vel   para esses utilit&aacute;rios restaura-lo. Nesses casos, medidas mais dr&aacute;sticas   podem ser necess&aacute;rias para colocar o BD on-line novamente. Se voce n&atilde;o   conseguir recuperar seu BD, entre em contato conosco e n&oacute;s veremos o   que poderemos fazer para ajudar. </font></P><P><font face="Arial, Helvetica, sans-serif">A causa mais freq&uuml;ente de corrup&ccedil;&atilde;o   &eacute; a queda de energia no servidor de banco de dados. Cortar a energia   quando uma aplica&ccedil;&atilde;o est&aacute; em processo de grava&ccedil;&atilde;o   no Banco de Dados pode resultar que dados incompletos ou corrompidos sejam gravados   no arquivo de Banco de Dados. Em todos os casos, o usu&aacute;rio e o administrador   de sistema deve tomar todos os cuidados necess&aacute;rios para que isso n&atilde;o   aconte&ccedil;a. </font></P><P><font face="Arial, Helvetica, sans-serif">O InterBase tem dois modos de escrita   (escrita for&ccedil;ada), s&iacute;ncrono e ass&iacute;ncrono. Nas vers&otilde;es   anteriores do IB, o modo de escrita padr&atilde;o era s&iacute;ncrona. </font></P><P><b><font face="Arial, Helvetica, sans-serif">gfix -write sync database.gdb   </font></b></P><P><font face="Arial, Helvetica, sans-serif">No IB 6.0, a escrita padr&atilde;o   &eacute; ass&iacute;ncrona : </font></P><P><font face="Arial, Helvetica, sans-serif"><b>gfix -write async database.gdb   </b></font></P><P><font face="Arial, Helvetica, sans-serif">A escrita s&iacute;ncrona tamb&eacute;m   &eacute; conhecida como "escrita cuidadosa" e nela o Interbase ir&aacute; gravar   as p&aacute;ginas alteradas assim que a transa&ccedil;&atilde;o for commitada,   e retorna-las ao BD na ordem correta (em se tratando do servidor). Esse tipo   de escrita funciona bem em ambientes Linux ou Unix, mas causam alguns problemas   no Windows e no NT. Esses sistemas ignoram as instru&ccedil;&otilde;es de escrita   do Interbase e, mesmo as p&aacute;ginas tendo sido commitadas e gravadas, elas   somente ser&atilde;o realmente gravadas quando o sistema operacional achar que   &eacute; melhor faze-lo, mesmo com a op&ccedil;&atilde;o de escrita-for&ccedil;ada   ligada. Portanto, apesar da corrup&ccedil;&atilde;o de arquivos ser rara, o   Windows &eacute; o sistema mais suscet&iacute;vel &agrave; uma poss&iacute;vel   corrup&ccedil;&atilde;o. </font></P><P><font face="Arial, Helvetica, sans-serif">Geralmente a maioria dos usu&aacute;rios   deixam a op&ccedil;&atilde;o de escrita-for&ccedil;ada desligada devido ao ganho   de performance que se pode obter deixando que o Sistema Operacional gerencie   seu cache de dados automaticamente. Se voce est&aacute; usando escrita ass&iacute;ncrona,   tome muito cuidado com sua estrat&eacute;gia de backup, no caso do pior acontecer.   </font></P><P><font face="Arial, Helvetica, sans-serif">Nas vers&otilde;es anteriores do   IB 6.0, o aplicativo Server Manager oferecia alguns recursos de valida&ccedil;&atilde;o   de um BD, assim como o atual IBConsole, no entanto, eu recomendo o uso do utilit&aacute;rio   GFIX para essa fun&ccedil;&atilde;o devido ao seu maior n&uacute;mero de op&ccedil;&otilde;es   e flexibilidade. </font></P><P><font face="Arial, Helvetica, sans-serif">A corrup&ccedil;&atilde;o de um BD   que pode ser reparada geralmente poder&aacute; ser recuperada usando o gfix   ou uma combina&ccedil;&atilde;o do gfix e do gbak. </font></P><P><font face="Arial, Helvetica, sans-serif">1. Defina as seguints vari&aacute;veis   para tornar o processo mais f&aacute;cil pois voce n&atilde;o ter&aacute; que   digitar toda hora o usu&aacute;rio e a senha. </font></P><P><b><font face="Arial, Helvetica, sans-serif">SET ISC_USER=SYSDBA </font></b></P><P><b><font face="Arial, Helvetica, sans-serif">SET ISC_PASSWORD=masterkey </font></b></P><P><font face="Arial, Helvetica, sans-serif">2. Sempre tenha certeza de estar   trabalhando com uma c&oacute;pia do BD e n&atilde;o o arquivo original. Use   o sistema operacional para fazer uma c&oacute;pia do arquivo. Voce deve ter   acesso exclusivo ao BD para fazer isso. </font></P><P><b><font face="Arial, Helvetica, sans-serif">copy employee.gdb database.gdb   </font></b></P><P><font face="Arial, Helvetica, sans-serif">3.Agora confira se o BD est&aacute;   corrompido. Voce precisa ter acesso exclusivo ao BD para fazer isso, mas como   voce est&aacute; trabalhando com uma c&oacute;pia do BD original, isso n&atilde;o   &eacute; problema. </font></P><P><font face="Arial, Helvetica, sans-serif"><b>gfix -v -full database.gdb </b></font></P><P><font face="Arial, Helvetica, sans-serif">4. Se o comando anterior indicou   que h&aacute; um problema com o BD, agora n&oacute;s devemos repara-lo. </font></P><P><b><font face="Arial, Helvetica, sans-serif">gfix -mend -full -ignore database.gdb   </font></b></P><P><font face="Arial, Helvetica, sans-serif">5.O pr&oacute;ximo passo &eacute;   conferir se o BD foi reparado. </font></P><P><b><font face="Arial, Helvetica, sans-serif">gfix -v -full database.gdb </font></b></P><P><font face="Arial, Helvetica, sans-serif">6. Se o BD continua com erros, voce   deve fazer um backup completo e restaura-lo. No seu estilo mais simples, a linha   de comando do backup pode ser : </font></P><P><b><font face="Arial, Helvetica, sans-serif">gbak -backup -v -ignore database.gdb   database.gbk </font></b></P><P><font face="Arial, Helvetica, sans-serif">7. No entanto, se o gbak falhar porque   est&aacute; tendo problemas com garbage collection, ent&atilde;o use o seguinte   comando : </font></P><P><b><font face="Arial, Helvetica, sans-serif">gbak -backup -v -ignore -garbage   database.gdb database.gbk </font></b></P><P><font face="Arial, Helvetica, sans-serif">8. Se houver corrup&ccedil;&atilde;o   nas vers&otilde;es dos registros de uma transa&ccedil;&atilde;o em limbo, ent&atilde;o   voce deve incluir a op&ccedil;&atilde;o -limbo : </font></P><P><b><font face="Arial, Helvetica, sans-serif">gbak -backup -v -ignore -garbage   -limbo database.gdb database.gbk </font></b></P><P><font face="Arial, Helvetica, sans-serif">9. Agora crie um novo BD do backup:   </font></P><P><b><font face="Arial, Helvetica, sans-serif">gbak -create -v atlas.gbk atlas_new.gdb   </font></b></P><P><font face="Arial, Helvetica, sans-serif">10. Se houver problemas durante o   restore, considere usar as seguintes op&ccedil;&otilde;es. </font></P><P><font face="Arial, Helvetica, sans-serif">-inactive, se houver problemas de   &iacute;ndices, isso ir&aacute; restaurar o BD mas n&atilde;o ir&aacute; ativar   nenhum &iacute;ndice, depois voce poder&aacute; ativar os &iacute;ndices manualmente   um de cada vez. </font></P><P><font face="Arial, Helvetica, sans-serif">-one_at_a_time, isso ir&aacute; restaurar   o BD uma tabela por vez, e commitar as tabelas restauradas, se houver um problema   maior pelo menos voce ter&aacute; uma parte dos dados. </font></P><p><font face="Arial, Helvetica, sans-serif">Caso os passos indicados não resolvam o seu problema, e você não consiga nem mesmo conectar o banco de dados, verifique o nosso serviço de recuperação de bases de dados (veja mais informações neste <a href="http://www.firebase.com.br/fb/parceria_ibaid.php">link</a>).</font></p><P><font face="Arial, Helvetica, sans-serif">Caso esteja conseguindo acessar a base de dados corrompida,  considere usar o QLI para mover os dados e estruturas das tabelas do BD danificado para um novo.   </font></P><P><font face="Arial, Helvetica, sans-serif">1. Crie um banco de dados em branco.   </font></P><P><font face="Arial, Helvetica, sans-serif">2. Edite o seguinte (get_tables.sql)   para apontar para o BD corrompido. </font></P><P><font face="Arial, Helvetica, sans-serif">connect database.gdb </font></P><P><font face="Arial, Helvetica, sans-serif"> user 'sysdba' password 'masterkey;   </font></P><P><font face="Arial, Helvetica, sans-serif">select 'define relation tgt.', </font><br>  <font face="Arial, Helvetica, sans-serif">rdb$relation_name, </font><font face="Arial, Helvetica, sans-serif">'   based on relation src.', rdb$relation_name, ';' <br>  </font><font face="Arial, Helvetica, sans-serif">from rdb$relations <br>  </font><font face="Arial, Helvetica, sans-serif">where rdb$relation_name not   starting with 'RDB$'; <br>  </font><font face="Arial, Helvetica, sans-serif">commit; </font></P><P><font face="Arial, Helvetica, sans-serif">select 'tgt.', </font><font face="Arial, Helvetica, sans-serif">rdb$relation_name,   </font><br>  <font face="Arial, Helvetica, sans-serif">' = src.', rdb$relation_name, ';'<br>  </font><font face="Arial, Helvetica, sans-serif">from rdb$relations </font><br>  <font face="Arial, Helvetica, sans-serif">where rdb$relation_name not starting   with 'RDB$'; </font></P><P><font face="Arial, Helvetica, sans-serif">3. Edite o arquivo resultante para   que ele se pare&ccedil;a com isso : </font></P><P><font face="Arial, Helvetica, sans-serif">ready old.gdb as src;<br>  </font><font face="Arial, Helvetica, sans-serif">ready new.gdb as tgt;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.COUNTRY   based on relation src.COUNTRY;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.JOB based   on relation src.JOB;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.DEPARTMENT   based on relation src.DEPARTMENT;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.EMPLOYEE   based on relation src.EMPLOYEE;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.PROJECT   based on relation src.PROJECT;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.PHONE_LIST   based on relation src.PHONE_LIST;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.EMPLOYEE_PROJECT   based on relation src.EMPLOYEE_PROJECT; </font></P><P><font face="Arial, Helvetica, sans-serif">define relation tgt.CUSTOMER based   on relation src.CUSTOMER;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.SALES based   on relation src.SALES;<br>  </font><font face="Arial, Helvetica, sans-serif">define relation tgt.PROJ_DEPT_BUDGET   based on relation src.PROJ_DEPT_BUDGET; </font></P><P><font face="Arial, Helvetica, sans-serif">define relation tgt.SALARY_HISTORY   based on relation src.SALARY_HISTORY; </font></P><P><font face="Arial, Helvetica, sans-serif">tgt.COUNTRY = src.COUNTRY;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.JOB = src.JOB;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.DEPARTMENT = src.DEPARTMENT;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.EMPLOYEE = src.EMPLOYEE;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.PROJECT = src.PROJECT;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.PHONE_LIST = src.PHONE_LIST;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.EMPLOYEE_PROJECT = src.EMPLOYEE_PROJECT;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.CUSTOMER = src.CUSTOMER;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.SALES = src.SALES;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.PROJ_DEPT_BUDGET = src.PROJ_DEPT_BUDGET;<br>  </font><font face="Arial, Helvetica, sans-serif">tgt.SALARY_HISTORY = src.SALARY_HISTORY;   </font></P><P><font face="Arial, Helvetica, sans-serif">4. Agora instale a vers&atilde;o   apropriada do QLI no diret&oacute;rio interbase\bin e rode o script QLI invocando   o QLI e rodando o script move.sql. </font></P><P><font face="Arial, Helvetica, sans-serif"><b>QLI&gt;@move.sql </b></font></P><P><font face="Arial, Helvetica, sans-serif">Para ajudar voce &agrave; entender   o que exatamenteo gfix est&aacute; fazendo, aqui est&aacute; um peda&ccedil;o   do c&oacute;digo fonte, que explica em detalhes o que est&aacute; acontecendo.   </font></P><h2>&nbsp;</h2><pre>/* *	PROGRAM:	JRD Access Method *	MODULE:		val.c *	DESCRIPTION:	Validation and garbage collection * * copyright (c) 1985, 1997 by Borland International * copyright (c) 1999 by Inprise Corporation */#ifdef INTERNAL_DOCUMENTATIONDatabase Validation and Repair============================== Deej Bredenberg March 16, 1994Updated: 1996-Dec-11 David Schnepper I. TERMINOLOGY The following terminology will be helpful to understand in this discussion:record fragment:The smallest recognizable piece of a record; multiple fragments can be linked together to form a single version.record version: A single version of a record representing an INSERT, UPDATE or DELETE by a particular transaction (note that deletion of a record causes a new version to be stored as adeleted stub).record chain: A linked list of record versions chained together to represent a single logical "record".slot: The line number of the record on page.  A variable-length array on each data page stores the offsets to the stored records on that page, and the slot is an index into that array.II. COMMAND OPTIONSHere are all the options for gfix which have to do with validation, and what they do:gfix switch   dpb parameter      -----------   -------------      -validate    isc_dpb_verify  (gds__dpb_verify prior to 4.0)Invoke validation and repair.  All other switches modify this switch.-full        isc_dpb_records       Visit all records.  Without this switch, only page structures will be validated, which does involve some limited checking of records.     -mend        isc_dpb_repair     Attempts to mend the database where it can to make it viable for reading; does not guarantee to retain data.-no_update   isc_dpb_no_update  Specifies that orphan pages not be released, and allocated pages not be marked in use when found to be free.  Actually a misleading switch name since -mend will update the database, but if -mend is not specified and -no_update is specified, then no updates will occur to the database.-ignore      isc_dpb_ignoreTells the engine to ignore checksums in fetching pages.  Validate will report on the checksums, however.  Should probably not even be a switch, it should just always be in effect.  Otherwise checksums will disrupt the validation.  Customers should be advised to always use it.NOTE: Unix 4.0 (ODS 8.0) does not have on-page checksums, and all platforms under ODS 9.0 do not have checksums.III.  OPERATIONValidation runs only with exclusive access to the database, to ensure that database structures are not modified during validation.  On attach, validate attempts to obtain an exclusive lock on the database.If other attachments are already made locally or through the same multi- client server, validate gives up with the message:"Lock timeout during wait transaction-- Object "database_filename.gdb" is in use"If other processes or servers are attached to the database, validate  waits for the exclusive lock on the database (i.e. waits for every other server to get out of the database).NOTE: Ordinarily when processes gain exclusive access to the database, all active transactions are marked as dead on the Transaction Inventory Pages.  This feature is turned off for validation.IV. PHASES OF VALIDATIONThere are two phases to the validation, the first of which is a walk through the entire database (described below).  During this phase, all pages visited are stored in a bitmap for later use during the garbage collection phase.   A. Visiting PagesDuring the walk-through phase, any page that is fetched goes through a basic validation:1. Page Type CheckEach page is check against its expected type.  If the wrong typepage is found in the page header, the message:"Page xxx wrong type (expected xxx encountered xxx)"is returned.  This could represent a) a problem with the database being overwritten, b) a bug with InterBase page allocation mechanisms in which one page was written over another, or c) a page which was allocated but never written to disk (most likely if the encounteredpage type was 0).The error does not tell you what page types are what, so herethey are for reference:#define pag_undefined     0    /* purposely undefined */#define pag_header        1    /* Database header page */#define pag_pages         2    /* Page inventory page */#define pag_transactions  3    /* Transaction inventory page */#define pag_pointer       4    /* Pointer page */#define pag_data          5    /* Data page */#define pag_root          6    /* Index root page */#define pag_index         7    /* Index (B-tree) page */#define pag_blob          8    /* Blob data page */#define pag_ids           9    /* Gen-ids */#define pag_log           10   /* Write ahead log page: 4.0 only */2. ChecksumIf -ignore is specified, the checksum is specifically checked invalidate instead of in the engine.  If the checksum is found to be wrong, the error: "Checksum error on page xxx"is returned. This is harmless when found by validate, and the pagewill still continue to be validated - if data structures can be validated on page, they will be.  If -mend is specified, the page will be marked for write, so that when the page is written to disk at the end of validation the checksum will automatically be recalculated.Note: For 4.0 only Windows &amp; NLM platforms keep page checksums.3. RevisitWe check each page fetched against the page bitmap to make sure wehave not visited already.  If we have, the error: "Page xxx doubly allocated"is returned.  This should catch the case when a page of the same type is allocated for two different purposes.Data pages are not checked with the Revisit mechanism - when walkingrecord chains and fragments they are frequently revisited.B. Garbage CollectionDuring this phase, the Page Inventory (PIP) pages are checked against thebitmap of pages visited.  Two types of errors can be detected duringthis phase.1. Orphan PagesIf any pages in the page inventory were not visited during validation, the following error will be returned:"Page xxx is an orphan"If -no_update was not specified, the page will be marked as freeon the PIP.2. Improperly Freed PagesIf any pages marked free in the page inventory were in fact found to be in use during validation, the following error will be returned: "Page xxx is use but marked free"  (sic)     If -no_update was not specified, the page will be marked in useon the PIP.NOTE:  If errors were found during the validation phase, no changes willbe made to the PIP pages.  This assumes that we did not have a chance tovisit all the pages because invalid structures were detected.V. WALK-THROUGH PHASEA. Page FetchingIn order to ensure that all pages are fetched during validation, thefollowing pages are fetched just for the most basic validation:1. The header page (and for 4.0 any overflow header pages).2. Log pages for after-image journalling (4.0 only).3. Page Inventory pages.4. Transaction Inventory pagesIf the system relation RDB$PAGES could not be read or did notcontain any TIP pages, the message: "Transaction inventory pages lost" will be returned.  If a particular page is missing from the sequence as established by RDB$PAGE_SEQUENCE, then the followingmessage will be returned:                                        "Transaction inventory page lost, sequence xxx"If -mend is specified, then a new TIP will be allocated on disk and stored in RDB$PAGES in the proper sequence.  All transactions which would have been on that page are assumed committed. If a TIP page does not point to the next one in sequence, thefollowing message will be returned:"Transaction inventory pages confused, sequence xxx"5. Generator pages as identified in RDB$PAGES.B. Relation WalkingAll the relations in the database are walked.  For each relation, allindices defined on the relation are fetched, and all pointer and data pages associated with the relation are fetched (see below).But first, the metadata is scanned from RDB$RELATIONS to fetch theformat of the relation.  If this information is missing or corrupted the relation cannot be walked.  If any bugchecks are encountered from the scan, the following message is returned:"bugcheck during scan of table xxx (&lt;table_name&gt;)"This will prevent any further validation of the relation.NOTE: For views, the metadata is scanned but nothing further is done.C. Index WalkingPrior to 5.0 Indices were walked before data pages.In 5.0 Index walking was moved to after data page walking.Please refer to the later section entitled "Index Walking".D. Pointer PagesAll the pointer pages for the relation are walked.  As they are walkedall child data pages are walked (see below).  If a pointer page cannot be found, the following message is returned:"Pointer page (sequence xxx) lost"If the pointer page is not part of the relation we expected orif it is not marked as being in the proper sequence, the followingmessage is returned:                       "Pointer page xxx is inconsistent" If each pointer page does not point to the next pointer page asstored in the RDB$PAGE_SEQUENCE field in RDB$PAGES, the following error is returned:"Pointer page (sequence xxx) inconsistent"E. Data PagesEach of the data pages referenced by the pointer page is fetched.If any are found to be corrupt at the page level, and -mend is specified, the page is deleted from its pointer page.  This will cause a whole page of data to be lost.The data page is corrupt at the page level if it is not marked aspart of the current relation, or if it is not marked as being in the proper sequence.  If either of these conditions occurs, the following error is returned:"Data page xxx (sequence xxx) is confused"F. Slot ValidationEach of the slots on the data page is looked at, up to the countof records stored on page.  If the slot is non-zero, the record fragment at the specified offset is retrieved.  If the recordbegins before the end of the slots array, or continues off theend of the page, the following error is returned:"Data page xxx (sequence xxx), line xxx is bad"where "line" means the slot number.    NOTE: If this condition is encountered, the data page is considered corrupt at the page level (and thus will be removed from itspointer page if -mend is specified).                                          G. Record Validation                       The record at each slot is looked at for basic validation, regardlessof whether -full is specified or not.  The fragment could be any of the following:1.  Back VersionIf the fragment is marked as a back version, then it is skipped.  It will be fetched as part of its record.2.  CorruptIf the fragment is determined to be corrupt for any reason, and -mend is specified, then the record header is marked as damaged.3.  DamagedIf the fragment is marked damaged already from a previous visit ora previous validation, the following error is returned:      "Record xxx is marked as damaged"where xxx is the record number.  4.  Bad Transaction If the record is marked with a transaction id greater than the last transaction started in the database, the following error is returned:                                         "Record xxx has bad transaction xxx"H. Record WalkingIf -full is specified, and the fragment is the first fragment in a logicalrecord, then the record at this slot number is fully retrieved.  Thisinvolves retrieving all versions, and all fragments of each particular version.  In other words, the entire logical record will be retrieved.1. Back VersionsIf there are any back versions, they are visited at this point.  If the back version is on another page, the page is fetched but not validated since it will be walked separately.  If the slot number of the back version is greater than the maxrecords on page, or there is no record stored at that slot number, or it is a blob record, or it is a record fragment, or the fragment itself is invalid, the following error message is returned:"Chain for record xxx is broken"2. IncompleteIf the record header is marked as incomplete, it means that thereare additional fragments to be fetched--the record was too large to be stored in one slot.A pointer is stored in the record to the next fragment in the list.For fragmented records, all fragments are fetched to form a fullrecord version.  If any of the fragments is not in a valid position,or is not the correct length, the following error is returned:"Fragmented record xxx is corrupt"         Once the full record has been retrieved, the length of the format ischecked against the expected format stored in RDB$FORMATS (the format number is stored with the record, representing the exact format of the relation at the time the record was stored.)  If the length of the reconstructed record does not matchthe expected format length, the following error is returned:"Record xxx is wrong length"For delta records (record versions which represent updates to the record)this check is not made.I. Blob Walking If the slot on the data page points to a blob record, then the blobis fetched (even without -full).  This has several cases, corresponding to the various blob levels.               Level                      Action-----   ----------------------------------------------------------------- 0     These are just records on page, and no further validation is done.1     All the pages pointed to by the blob record are fetched and      validated in sequence.2     All pages pointed to by the blob pointer pages are fetched and       validated.3     The blob page is itself a blob pointer page; all its children      are fetched and validated.For each blob page found, some further validation is done.  If thepage does not point back to the lead page, the following error is returned:"Warning: blob xxx appears inconsistent"   where xxx corresponds to the blob record number.  If any of the blob pagesare not marked in the sequence we expect them to be in, the followingerror is returned: "Blob xxx is corrupt" Tip: the message for the same error in level 2 or 3 blobs is slightlydifferent:"Blob xxx corrupt"If we have lost any of the blob pages in the sequence, the following erroris returned:"Blob xxx is truncated"If the fetched blob is determined to be corrupt for any of the abovereasons, and -mend is specified, then the blob record is marked asdamaged.J. Index WalkingIn 5.0 Index walking was moved to after the completionof data page walking.The indices for the relation are walked.  If the index root pageis missing, the following message is returned:"Missing index root page"and the indices are not walked.  Otherwise the index root pageis fetched and all indices on the page fetched. For each index, the btree pages are fetched from top-down, left toright.  Basic validation is made on non-leaf pages to ensure that each nodeon page points to another index page.  If -full validation is specifiedthen the lower level page is fetched to ensure it is starting indexentry is consistent with the parent entry. On leaf pages, the records pointed to by the index pages are not fetched, the keys are looked at to ensure they are in correct ascending order.If a visited page is not part of the specified relation and index,the following error is returned:      "Index xxx is corrupt at page xxx"        If there are orphan child pages, i.e. a child page does not have its entry as yet in the parent page, however the child's left sibling page has it's btr_sibling updated, the following error is returned	    "Index xxx has orphan child page at page xxx"If the page does not contain the number of nodes we would haveexpected from its marked length, the following error is returned:"Index xxx is corrupt on page xxx"While we are walking leaf pages, we keep a bitmap of all recordnumbers seen in the index.  At the conclusion of the index walkwe compare this bitmap to the bitmap of all records in the relation (calculated during data page/Record Validation phase).If the bitmaps are not equal then we have a corrupt indexand the following error is reported:"Index %d is corrupt (missing entries)"We do NOT check that each version of each record has a validindex entry - nor do we check that the stored key for each itemin the index corresponds to a version of the specified record.K. Relation CheckingWe count the number of backversions seen while walking pointer pages,and separately count the number of backversions seen while walkingrecord chains.  If these numbers do not match it indicates either"orphan" backversion chains or double-linked chains.  If this issee the following error is returned:"Relation has %ld orphan backversions (%ld in use)"Currently we do not try to correct this condition, mearly reportit.  For "orphan" backversions the space can be reclaimed bya backup/restore.  For double-linked chains a SWEEP shouldremove all the backversions.VI. ADDITIONAL NOTESA.  Damaged RecordsIf any corruption of a record fragment is seen during validation, the record header is marked as "damaged".  As far as I can see, this has no effect on the engine per se.  Records marked as damaged will still be retrieved by the engine itself.  There is some question in my mind asto whether this record should be retrieved at all during a gbak.If a damaged record is visited, the following error message will appear:"Record xxx is marked as damaged"Note that when a damaged record is first detected, this message is notactually printed.  The record is simply marked as damaged.  It is only thereafter when the record is visited that this message will appear.So I would postulate that unless a full validation is done at some point,you would not see this error message; once the full validation is done, the message will be returned even if you do not specify -full.B. Damaged BlobsBlob records marked as damaged cannot be opened and will not be deleted from disk.  This means that even during backup the blob structures marked as damaged will not be fetched and backed up.  (Why this is donedifferently for blobs than for records I cannot say.  Perhaps it was viewed as too difficult to try to retrieve a damaged blob.)#endif /* INTERNAL_DOCUMENTATION</pre></td>
              </tr>
              <tr valign="middle">
                <td bgcolor="#DDDDDD" class="TextoPadrao"><form id="form1" name="form1" method="post" action="avaliar.php">
                    <b>Avalie esse artigo:</b>
                    <select name="nota" id="nota">
                      <option value="5">Excelente</option>
                      <option value="4">Muito bom</option>
                      <option value="3">Bom</option>
                      <option value="2">Regular</option>
                      <option value="1">Ruim</option>
                    </select>
                    <input name="Submit" type="submit" id="Submit" value="Avaliar" />
                    <input name="ID" type="hidden" value="3" />
                    &nbsp;
                    <input name="Voltar" type="button" value="Voltar" onclick="history.back()" />
                  </form></td>
                <td bgcolor="#DDDDDD" class="TextoPadrao"><iframe src="share.php?id=3&titulo=Diagnosticando+e+Reparando+Banco+de+Dados+Corrompidos" scrolling="No" frameborder="0" style="border:none; overflow:hidden; height:20px; width:320px" allowtransparency="true" align="right"/></iframe></td>
              </tr>
            </table>
            <br  />
            <div align="center"> 
              <script type="text/javascript"><!--
			  google_ad_client = "pub-8009790593141284";
			  google_ad_width = 728;
			  google_ad_height = 90;
			  google_ad_format = "728x90_as";
			  google_ad_type = "text_image";
			  //2006-12-31: Artigos/FAQ
			  google_ad_channel = "5410729626";
			  google_color_border = "000000";
			  google_color_bg = "F0F0F0";
			  google_color_link = "0000FF";
			  google_color_text = "000000";
			  google_color_url = "008000";
			  //--></script> 
              <script type="text/javascript" src="http://pagead2.googlesyndication.com/pagead/show_ads.js"></script> 
              <h2>Comentários</h2>
              <table width='95%' border='0' cellpadding='0' cellspacing='0' align='center'><tr bgcolor='#FFFFFF'><td valign='top'><img src='/fb/custimg/comment.png' align='left' border='0' /><h3>Márcio Zaneti Palma [01.12.08]</h3></td></tr><tr bgcolor='#FFFFFF'><td>Parabéns!!!! Completo e simples - não poderia ser melhor!!!!</td></tr><tr><td>&nbsp;</td></tr></table><table width='95%' border='0' cellpadding='0' cellspacing='0' align='center'><tr bgcolor='#FFFFFF'><td valign='top'><img src='/fb/custimg/comment.png' align='left' border='0' /><h3>cdnsolution [02.03.10]</h3></td></tr><tr bgcolor='#FFFFFF'><td>salvou minha vida lol</td></tr><tr><td>&nbsp;</td></tr></table><table width='95%' border='0' cellpadding='0' cellspacing='0' align='center'><tr bgcolor='#FFFFFF'><td valign='top'><img src='/fb/custimg/comment.png' align='left' border='0' /><h3>Anderson Santos Oliveira [01.04.11]</h3></td></tr><tr bgcolor='#FFFFFF'><td>Melhor do que essas informações somente se a base não tivesse dado problemas...</td></tr><tr><td>&nbsp;</td></tr></table><table width='95%' border='0' cellpadding='0' cellspacing='0' align='center'><tr bgcolor='#FFFFFF'><td valign='top'><img src='/fb/custimg/comment.png' align='left' border='0' /><h3>Daniel [10.09.11]</h3></td></tr><tr bgcolor='#FFFFFF'><td>Esse artigo me ajudou e muito, consegui reparar um banco de dados Firebird 2.1.3 que tinha sido corrompido após uma queda de luz! Grande ajuda, valeu!!! :D </td></tr><tr><td>&nbsp;</td></tr></table>              
              <form id="insert_comment" name="insert_comment" method="post" action="/fb/inserir_comment.php">
                <table border="0" align="center" cellpadding="15" cellspacing="0" bgcolor="#DDDDDD" width="600">
                  <tr>
                    <td>
                    <h3 align="center">Atenção! Não poste dúvidas técnicas nos comentários. Para obter suporte, use a lista de discussão da FireBase.</h3>
                    <textarea name="comentario" id="comentario" cols="60" rows="4"></textarea></td>
                    <td width="180"><div align="center">
                        <input type="submit" name="Submit" value="Inserir coment&aacute;rio" /><input name="id" type="hidden" id="id" value="3" /><input name="download" type="hidden" id="download" value="N" />                      </div></td>
                  </tr>
                </table>
              </form>
            </div>
                        <!-- InstanceEndEditable --></td></tr></table></td>
  </tr>
</table>
<map name="MapMenu" id="MapMenu">
  <area shape="rect" coords="913,5,991,25" href="about.php" alt="About" />
  <area shape="rect" coords="41,123,103,137" href="noticias.php?recentes=1" alt="Not&iacute;cias" />
  <area shape="rect" coords="25,22,135,102" href="index.php" alt="P&aacute;gina Principal" />
  <area shape="rect" coords="123,122,181,138" href="artindex.php" />
  <area shape="rect" coords="944,121,985,137" href="login.php" alt="Login" />
  <area shape="rect" coords="204,121,232,137" href="faqindex.php" alt="FAQ" />
  <area shape="rect" coords="255,123,344,136" href="consultoria.php" alt="Consultoria" />
  <area shape="rect" coords="365,122,447,140" href="downloads.php" alt="Downloads" />
  <area shape="rect" coords="469,122,602,138" href="lista.php" alt="Lista de discuss&atilde;o" />
  <area shape="rect" coords="732,122,792,138" href="contato.php" alt="Contato" />
  <area shape="rect" coords="814,122,858,138" href="procura.php" alt="Pesquisar" />
  <area shape="rect" coords="883,122,920,137" href="links.php" alt="Links" />
  <area shape="rect" coords="622,123,710,137" href="produtos.php" alt="Produtos a venda" />
</map>
<br />
<hr />
<p align="center" style="font-family:Verdana, Arial, Helvetica, sans-serif; font-size:xx-small">Copyright (c) Carlos H. Cantu - É proibida a reprodução de qualquer material desse site sem autorização prévia</p>
</td>
</tr>
</table>
</body>
<!-- InstanceEnd --></html>